# Contains Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
PlanCircuitSet..::..Contains Method
PlanCircuitSet Class See Also
---
Tests for the existence of an item within the set.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public virtual bool Contains(
	PlanCircuit item
)
```

Visual Basic
---
```text
Public Overridable Function Contains ( _
	item As PlanCircuit _
) As Boolean
```

Visual C++
---
```text
public:
virtual bool Contains(
	PlanCircuit^ item
)
```

# ### Parameters
item
    Type: Autodesk.Revit.DB..::..PlanCircuitThe item to be searched for.
# ### Return Value
The Contains method returns True if the item is within the set, otherwise False.
# See Also
PlanCircuitSet Class
Autodesk.Revit.DB Namespace